// ======================================================================================
// 文件名         ：    Knowlege_Learned.cs
// 版本号         ：    v2.0.0
// 作者           ：    wuwenthink
// 创建日期       ：    2017-8-24
// 最后修改日期   ：    2017-11-18 14:43
// ======================================================================================
// 功能描述       ：    已学过的学识的数据
// ======================================================================================

/// <summary>
/// 已学过的学识
/// </summary>
public class Knowledge_Learned : Knowledge
{
    public Knowledge_Learned (int _id, int _exp = 0) : base (_id)
    {
        Exp = _exp;
    }

    public int Exp { get; set; }
}