// ======================================================================================
// 文件名         ：    Skill_Learned.cs
// 版本号         ：    v2.0.0
// 作者           ：    wuwenthink
// 创建日期       ：    2017-8-28
// 最后修改日期   ：    2017-11-18 14:57
// ======================================================================================
// 功能描述       ：    已学过的技法
// ======================================================================================

/// <summary>
/// 已学过的技法
/// </summary>
public class Skill_Learned : Skill
{
    public Skill_Learned (int _id, int _exp = 0) : base (_id)
    {
        Exp = _exp;
    }

    public int Exp { get; set; }

}